ConfigFiles/Catalogs/ЗадачиПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроцесса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиШаблонаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролирующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДлительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтработкиПоручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредшествующиеЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредшествующаяЗадача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПротоколВзаимодействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПоручения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительПоручения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Enums/СтатусыЗадачПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадачПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятаКВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ЗадачиПроцесса/Forms/ПеренаправитьОтветить/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИмяКоманды          = Параметры.ИмяКоманды;
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ОбработатьПереданныеПараметры(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СтруктураВозврата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиРезультатыСогласования(Команда)
	
	ТекстСогласования = ЗадачиПроцессовКлиентСервер.ТекстРезультатыСогласования(ПредставлениеРесурса,
	                                                                            Согласовать,
	                                                                            КСогласованию - Согласовать);
	
	Если СтрНайти(ТекстПоручения, ТекстСогласования) > 0 Тогда
		Возврат;
	КонецЕсли;
		
	ТекстПоручения = ТекстПоручения 
	                + ?(ПустаяСтрока(ТекстПоручения), "", Символы.ПС)
	                + ТекстСогласования;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СтруктураВозврата()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТекстПоручения",               ТекстПоручения);
	СтруктураВозврата.Вставить("ИсполнительПорученияПоЗадаче", ИсполнительПорученияПоЗадаче);
	СтруктураВозврата.Вставить("НеСогласовано",                КСогласованию - Согласовать);
	СтруктураВозврата.Вставить("Согласовано",                  Согласовать);
	СтруктураВозврата.Вставить("ИмяКоманды",                   ИмяКоманды);
	СтруктураВозврата.Вставить("ТолькоРесурсыТекущейЗадачи",   ТолькоРесурсыТекущейЗадачи);
	СтруктураВозврата.Вставить("ПредставлениеВидаРесурса",     ПредставлениеРесурса);
	
	Возврат СтруктураВозврата;
	
КонецФункции 

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)

	Если ЗначениеЗаполнено(Параметры.Задача) Тогда
		
		Если Параметры.ИмяКоманды = "Ответить" Тогда
			
			ОбработатьПараметрыОтветить(Отказ);
			
		ИначеЕсли Параметры.ИмяКоманды = "НеСогласовать" Тогда
			
			СогласуемыйРесурс = Параметры.СогласуемыйРесурс;
			ОбработатьПараметрыНеСогласовать(Отказ, Ложь);
			
		ИначеЕсли Параметры.ИмяКоманды = "ЧастичноСогласовать" Тогда
			
			СогласуемыйРесурс = Параметры.СогласуемыйРесурс;
			ОбработатьПараметрыНеСогласовать(Отказ, Истина);
			
		КонецЕсли;
		
	Иначе
		
		Если Параметры.ИмяКоманды = "НаправитьИсполнителямЗадачи" Тогда
			
			Элементы.ИсполнительПорученияПоЗадаче.Видимость = Ложь;
			Элементы.ДекорацияИсполнителямЗадачи.Видимость  = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПараметрыНеСогласовать(Отказ, ЭтоЧастичноеСогласование)

	ШаблонОшибкиСогласующий           = НСтр("ru='Вы не являетесь согласующим ресурса ""%1"" задачи %2.'");
	ШаблонОшибкиНечегоНеСогласовывать = НСтр("ru='Для задачи %1 нет направленных на согласование ресурсов.'");
	ШаблонОшибкиОтменена              = НСтр("ru = 'Задача %1 находится в статусе ""Отменена"".'");
	ШаблонОшибкиПомеченНаУдаление     = НСтр("ru='Задача %1 помечена на удаление.'");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ЗадачиПроцессов.ТекстЗапросаПоЗадачамДляСогласованияТекущихЗадач();
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Параметры.Задача);
	Запрос.УстановитьПараметр("МассивЗадач",            МассивЗадач);
	Запрос.УстановитьПараметр("ВидСогласуемогоРесурса", СогласуемыйРесурс);
	Запрос.УстановитьПараметр("ТекущийПользователь",    ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ПометкаУдаления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонОшибкиПомеченНаУдаление, Выборка.Представление), Выборка.Задача);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Выборка.ТекущийСтатус = Перечисления.СтатусыЗадачПроцессов.Отменена Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонОшибкиОтменена, Выборка.Представление), Выборка.Задача);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ПредставлениеРесурса = ЗадачиПроцессовКлиентСервер.ПредставлениеВидаРесурса(Выборка.НаименованиеРесурса, Выборка.ЕдиницаИзмерения);
		
		Если Не Выборка.ЯвляетсяСогласующим Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонОшибкиСогласующий, ПредставлениеРесурса, Выборка.Представление), Выборка.Задача);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		КСогласованию = Выборка.КСогласованию;
		ТолькоРесурсыТекущейЗадачи = Истина;
		
		Если КСогласованию = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонОшибкиНечегоНеСогласовывать, Выборка.Представление), Выборка.Задача);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Параметры.ИмяКоманды = "НеСогласовать" Тогда
			ТекстПоручения = ЗадачиПроцессовКлиентСервер.ТекстРезультатыСогласования(ПредставлениеРесурса, 0, КСогласованию) + Символы.ПС;
			Заголовок = НСтр("ru = 'Не согласовать и направить исполнителю'");
		Иначе
			
			ПредставлениеКСогласованию                     = Строка(КСогласованию) + " " + Выборка.ЕдиницаИзмерения + ".";
			Согласовать                                    = КСогласованию;
			Элементы.ГруппаЧастичноеСогласование.Видимость = Истина;
			Элементы.ПеренестиРезультатыСогласования.Видимость = Истина;
			Элементы.Согласовать.МаксимальноеЗначение      = КСогласованию;
			Заголовок = НСтр("ru = 'Частично согласовать и направить исполнителю'");
			
		КонецЕсли;
		
		ИсполнительПорученияПоЗадаче = Выборка.Исполнитель;
		
		ТекущийЭлемент = Элементы.ТекстПоручения;
		
	Иначе
		
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПараметрыОтветить(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗадачиПроцессаПротоколВзаимодействия.Автор
	|ИЗ
	|	Справочник.ЗадачиПроцесса.ПротоколВзаимодействия КАК ЗадачиПроцессаПротоколВзаимодействия
	|ГДЕ
	|	ЗадачиПроцессаПротоколВзаимодействия.Ссылка = &Ссылка
	|	И ЗадачиПроцессаПротоколВзаимодействия.Автор <> &ТекущийПользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачиПроцессаПротоколВзаимодействия.НомерСтроки УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.Задача);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ИсполнительПорученияПоЗадаче = Выборка.Автор;
		
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Ответить'");
	
КонецПроцедуры

#КонецОбласти
